#include <stdio.h> 
#include <stdlib.h> 
#include <string.h>

//تابع برای مقایسه دو رشته
int my_strcmp(char *strg1, char *strg2)
{
    //تا زمانیکه دو رشته خالی نیستند و مقدار آن ها با هم برابر است به هر کدام یکی اضافه می کنیم
    while( ( *strg1 != '\0' && *strg2 != '\0' ) && *strg1 == *strg2 )
    {
        strg1++;
        strg2++;
    }

    if(*strg1 == *strg2)
    {
        return 0; // مقدار اشاره گر به دو رشته با هم برابرند پس صفر بر می گردد
    }
    else
    {
        return *strg1 - *strg2; //مقدار دو تا اشاره گر که دو رشته هستند را با هم مقایسه و از هم کم می کنیم
    }
}

void main()
{
// اشاره گر کاراکتر برای گرفتن رشته
char *a[30],dum[30];
//ان برای تعداد اشاره گر به آرایه بقیه برای پیمایش
int i,k,j,n;
printf("enter the no of student");
scanf("%d",&n);
//گرفتن مقادیر آرایه رشته های از ورودی و قرار دادن در آرایه
for(k=0;k<n;k++){
printf("enter the name of students(maximum: 9character) ");
scanf("%s",&a[k]);
}
// پیمایش آرایه برای مرتب سازی
for(i=0;i<n;i++)
{
for(j=1;j<n-i-1;j++)
{
    //مقایسه مقادیر هر دو خانه از آرایه با هم اگر بزرگتر از صفر بودند یعنی از هم بزرگترند پس جای آن ها را با هم عوض می کنیم تا آرایه مرتب شود
    if(my_strcmp(&a[j-1],&a[j])>0){
        //dum متغیر کمکی است
        //& یعنی آدرس خانه آرایه چون این خانه ها اشاره گر هستند آدرس آن ها را جابجا میکنیم
    strcpy(&dum,&a[j-1]);
   strcpy(&a[j-1],&a[j]);
   strcpy(&a[j],&dum);
 }
}
}
//چاپ آرایه
 for(i=0;i<n;i++){
 printf("%s",&a[i]);
 printf("\n");
 } 
 }
